InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийКассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПаспортист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяКонтрагентовДляСубсидийИЛьгот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЛьгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЛьгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентРегиональнаяСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорРегиональнаяСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСКартамиСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль "апРаботаСКартами": содержит процедуры и функции для работы с онлайн-
// картами и координатами.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция ПреобразоватьСтрокуВУТФ8(Стр) Экспорт
	
	Длина = СтрДлина(Стр);
    Итог = "";
    Для Н = 1 По Длина Цикл
        Знак = Сред(Стр, Н, 1);
        Код = КодСимвола(Знак);
		Если Код = 32 Тогда
			Итог = Итог + СимволВ16(Знак);
		ИначеЕсли Код < 128 Тогда
            Итог = Итог + Знак;
        Иначе
            Если (Код >= КодСимвола("А")) И (Код <= КодСимвола("п")) Тогда
                Итог = Итог + СимволВ16(Символ(208)) + СимволВ16(Символ(144 + Код - КодСимвола("А")));
            ИначеЕсли (Код >= КодСимвола("р")) И (Код <= КодСимвола("я")) Тогда
                Итог = Итог + СимволВ16(Символ(209)) + СимволВ16(Символ(128 + Код - КодСимвола("р")));
            ИначеЕсли (Знак = "ё") Тогда
                Итог = Итог + СимволВ16(Символ(209)) + СимволВ16(Символ(145));
            ИначеЕсли (Знак = "Ё") Тогда
                Итог = Итог + СимволВ16(Символ(208)) + СимволВ16(Символ(129));
            КонецЕсли;
        КонецЕсли;
	КонецЦикла;
	
    Возврат Итог;
	
КонецФункции

Функция СимволВ16(Символ)
	
	Возврат "%"+ПереводЧислаВСистемуСчисления(КодСимвола(Символ),16);
	
КонецФункции

Функция ПереводЧислаВСистемуСчисления(
		Знач Значение = 0, 
		Нотация = 64, 
		СтрокаСистемы = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz+/")
		
	Если Нотация <= 0 Тогда 
		Возврат "" КонецЕсли;
	Если Значение <= 0 Тогда 
		Возврат "0" 
	КонецЕсли;
	Значение = Цел(Значение);
	Результат = "";
	Пока Значение > 0 Цикл
		Результат = Сред(СтрокаСистемы, Значение % Нотация + 1, 1) + Результат;
		Значение = Цел (Значение / Нотация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Конвертирует переданные координаты из формата WGS84 в формат NMEA. 
//
//  Параметры:
//   Координаты - Массив - массив координат
//
//  Возвращаемое значение:
//   КоординатыNMEA - Строка - строка из координат, разделенных пробелом
//
Функция КонвертироватьWGS84NMEA(Координаты) Экспорт
	
	МассивКоординат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Координаты, " ");		
	
	Если МассивКоординат.Количество() < 2 Тогда
		Возврат "";
	КонецЕсли;	
	
	НайденныеКоординатыX = МассивКоординат[0]; 
	НайденныеКоординатыY = МассивКоординат[1];
	
	НайденныеКоординатыX = Цел(НайденныеКоординатыX)*100 + (НайденныеКоординатыX-Цел(НайденныеКоординатыX))*60;
	НайденныеКоординатыY = Цел(НайденныеКоординатыY)*100 + (НайденныеКоординатыY-Цел(НайденныеКоординатыY))*60;
	
	КоординатыNMEA = Строка(НайденныеКоординатыX) + " " + Строка(НайденныеКоординатыY);
	
	Возврат КоординатыNMEA;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С КАРТАМИ

Функция ПолучитьТекстМакета(ИмяМакета = "СкриптЯндексКарты") Экспорт
	
	ТекстСкрипта = ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();	
	
	Пользователь = Пользователи.ТекущийПользователь();
	ОсновнаяОрганизация = ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяОрганизация");
	
	Если НЕ ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК ОрганизацияСсылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОсновнаяОрганизация = Выборка.ОрганизацияСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнаяОрганизация) И НЕ ОсновнаяОрганизация.Долгота = 0 И НЕ ОсновнаяОрганизация.Широта = 0 Тогда
		
		Долгота = Формат(ОсновнаяОрганизация.Долгота, "ЧРД=.; ЧГ=0");
		Широта = Формат(ОсновнаяОрганизация.Широта, "ЧРД=.; ЧГ=0");
		
		ТекстСкрипта = СтрЗаменить(ТекстСкрипта, "latCenter = Convert(5026.0000)" , "latCenter = Convert(" + Широта + ")");
		ТекстСкрипта = СтрЗаменить(ТекстСкрипта, "lonCenter = Convert(3031.0000)" , "lonCenter = Convert(" + Долгота + ")");
		
	КонецЕсли;
	
	Возврат ТекстСкрипта;
	
КонецФункции

// Формирует параметр "Режим редактора" (режим + координаты центра карты - при их наличии)
//
//  Параметры:
//   РежимРедактора - Строка - режим редактора
//   ИсточникКарты - СправочникСсылка.апОнлайнКарты - ссылка на карту
//
//  Возвращаемое значение:
//   РежимРедактора - Строка - режим редактора с координатами центра карты (при их наличии)  
//
Функция СформироватьПараметрРежимРедактора(РежимРедактора, ИсточникКарты) Экспорт
	
	Если ПустаяСтрока(РежимРедактора) Тогда
		РежимРедактора = "";
	Иначе	
		ЦентрКартыШирота  = ИсточникКарты.ЦентрКартыШирота;
		ЦентрКартыДолгота = ИсточникКарты.ЦентрКартыДолгота;
		
		Если (Не ЦентрКартыШирота = 0) И (Не ЦентрКартыДолгота = 0) Тогда
			РежимРедактора = Строка(СтрЗаменить(ЦентрКартыШирота, ",",".")) + "@" + Строка(СтрЗаменить(ЦентрКартыДолгота, ",",".")) + "@" + РежимРедактора;	
		КонецЕсли;
	КонецЕсли;
		
	Возврат РежимРедактора;
	
КонецФункции

// Возвращает адрес здания из контактной информации
//
//  Параметры:
//   Партнер - СправочникСсылка.Партнеры - партнер, для которого нужно получить адрес из контактной информации
//
//  Возвращаемое значение:
//   АдресПартнера - Строка - адрес партнера из контактной информации
//
Функция ПолучитьАдресЗдания(ЗданиеОбъекта) Экспорт
	
	Если ТипЗнч(ЗданиеОбъекта) = Тип("СправочникСсылка.Организации") Тогда  
		ВидИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	Иначе
		ВидИнформации = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения;
	КонецЕсли; 	
	Возврат УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ЗданиеОбъекта, ВидИнформации);
	
КонецФункции

Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Настройка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";

	Выборка = Запрос.Выполнить().Выбрать();

	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();

	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;

	ИначеЕсли Выборка.Следующий() Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;

	Иначе
		Возврат ПустоеЗначение;

	КонецЕсли;

КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()
